app/Controllers/ClienteController.php

SELECT *
FROM `cliente`
 LIMIT 10, 10
SELECT COUNT(*) AS `numrows`
FROM `cliente`
---
    public function index()
    {
        $model = model(ClienteModel::class);

        $opcion = $this->request->getVar('opciones') ?? '';
        $buscar = $this->request->getVar('buscar') ?? '';



        if (!empty($opcion) && !empty($buscar)) {

            $clientes = $model->select('id, nombre, apellido, email','dui')
                ->where([$opcion => $buscar])
                ->paginate(10);

            $data = [
                'clientes' => $clientes,
                'pager' => $model->pager,
                'title' => 'cliente',
            ];

            return view('cliente/index', $data);

        } else {

            $clientes = $model->paginate(10);

INSERT INTO `cliente` (`nombre`, `apellido`, `email`, `dui`) VALUES ('andres', 'lopez', 'andres@gmail.com', '88888888-9')
---
    public function guardar() {

        $cliente = model(ClienteModel::class);

        $nombre = $this->request->getPost('nombre');
        $apellido = $this->request->getPost('apellido');
        $email = $this->request->getPost('email');
        $dui = $this->request->getPost('dui');

        $datos = [
            'nombre' => $nombre,
            'apellido' => $apellido,
            'email' => $email,
            'dui' => $dui,
        ];

        if ($cliente->save($datos) === false) {

SELECT *
FROM `cliente`
WHERE `cliente`.`id` = '1'
---
    public function edit($id) {

        $cliente = model(ClienteModel::class);
        $datos = $cliente->find($id);

UPDATE `cliente` SET `nombre` = 'Raffa', `apellido` = 'Remirez', `email` = 'rremirez0@vk.com', `dui` = '91583920-5'
WHERE `cliente`.`id` IN ('1')
---
    public function update($id) {

        $cliente = model(ClienteModel::class);

        $nombre = $this->request->getPost('nombre');
        $apellido = $this->request->getPost('apellido');
        $email = $this->request->getPost('email');
        $dui = $this->request->getPost('dui');

        $datos = [
            'id' => $id,
            'nombre' => $nombre,
            'apellido' => $apellido,
            'email' => $email,
            'dui' => $dui,
        ];

        if ($cliente->update($id, $datos) === false) {

DELETE FROM `cliente`
WHERE `id` IN ('1')
---
    public function delete($id) {

        $cliente = model(ClienteModel::class);
        $datos = $cliente->delete($id);